Revit 2024 API
ParameterTypeId.PlumbingFixturesWasteConnection Property
 "Waste Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId PlumbingFixturesWasteConnection { get; }
Visual Basic
Public Shared ReadOnly Property PlumbingFixturesWasteConnection As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PlumbingFixturesWasteConnection {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace